# DimensionSegment Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DimensionSegment Methods
DimensionSegment Class See Also
---
The DimensionSegment type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsTextPositionAdjustable | Indicates if this dimension is supported to set/get TextPosition/LeaderPosition. |
| ResetTextPosition | Resets the text position of the segment to the initial position determined by its type and parameters. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
DimensionSegment Class
Autodesk.Revit.DB Namespace